# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы.

integer=1
print(type(integer))
floating =1.1
print(type(floating))
boolean = False and True
print(type(boolean))
String_type = 'Hellow teacher >3'
print(type(String_type))
empty_type =  None
print(type(empty_type))
